app/views/test_perameters/_form.html.erb

    <%= form.label :category_id, "Category", style: "display: block", class:'form-label' %>
    <%= form.select :category_id, options_from_collection_for_select(Category.all, :id, :name), class:'form-select' %>
---
SELECT "categories".* FROM "categories"

    <%= form.label :test_id, style: "display: block", class:'form-label' %>
    <%= form.select :test_id, options_from_collection_for_select(Test.all, :id, :name), class:'form-select' %>
---
SELECT "tests".* FROM "tests"