app/controllers/doctors_controller.rb

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("name", "sex", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "najam"], ["sex", "male"], ["phone", "0303000000"], ["created_at", "2022-06-24 23:11:07.607279"], ["updated_at", "2022-06-24 23:11:07.607279"]]