app/controllers/patient_reports_controller.rb

SELECT "patient_reports".* FROM "patient_reports"
---
  def index
    @patient_reports = PatientReport.all