app/controllers/patients_controller.rb

INSERT INTO "patients" ("name", "age", "sex", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["age", ""], ["sex", ""], ["phone", ""], ["created_at", "2022-06-24 22:08:06.769722"], ["updated_at", "2022-06-24 22:08:06.769722"]]
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save