app/controllers/patient_cases_controller.rb

SELECT "patient_cases".* FROM "patient_cases"
---
  def index
    @patient_cases = PatientCase.all

INSERT INTO "patient_cases" ("patient_id", "doctor_id", "collection_date", "reporting_date", "total_amount", "paid", "due", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @patient_case = PatientCase.new(patient_case_params)

    respond_to do |format|
      if @patient_case.save

SELECT "patient_cases".* FROM "patient_cases" WHERE "patient_cases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_patient_case
      @patient_case = PatientCase.find(params[:id])