app/controllers/tests_controller.rb

INSERT INTO "tests" ("name", "rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "CBC"], ["rate", "700"], ["created_at", "2022-06-24 22:45:04.315461"], ["updated_at", "2022-06-24 22:45:04.315461"]]
---
  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save