app/controllers/test_perameters_controller.rb

  def index
    @test_perameters = TestPerameter.all
---
SELECT "test_perameters".* FROM "test_perameters"

  def create
    @test_perameter = TestPerameter.new(test_perameter_params)

    respond_to do |format|
      if @test_perameter.save
---
INSERT INTO "test_perameters" ("name", "range", "unit", "test_id", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "HB"], ["range", "M:13-17 F:12-16"], ["unit", "g/dl"], ["test_id", 1], ["created_at", "2022-06-25 20:58:27.118502"], ["updated_at", "2022-06-25 20:58:27.118502"], ["category_id", 3]]

    def set_test_perameter
      @test_perameter = TestPerameter.find(params[:id])
---
SELECT "test_perameters".* FROM "test_perameters" WHERE "test_perameters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]