app/views/patient_cases/_form.html.erb

SELECT "patients".* FROM "patients"
---
    <%= form.label :patient_id,"Select Patient", style: "display: block", class:'form-label' %>
    <%= form.select :patient_id, options_from_collection_for_select(Patient.all, :id, :name), {class: "form-select"} %>

SELECT "doctors".* FROM "doctors"
---
    <%= form.label :doctor_id,"Select Doctor", style: "display: block", class:'form-label' %>
    <%= form.select :doctor_id, options_from_collection_for_select(Doctor.all, :id, :name),{class: "form-select"} %>