app/views/tests/_test.html.erb

SELECT "tests".* FROM "tests"
---
    <tbody>
    <%= @test.test_perameters.each do |test_parameter| %>